# XML exercise

Using data from [**mondial database**](https://drive.google.com/file/d/14lFT4nWHgwN36ij4XZh6OUuup-K9qLgR/view?usp=sharing) find the answers to following questions:

1. 10 countries with the lowest infant mortality rates
2. 10 cities with the largest population
3. name and country of a) longest river, b) largest lake and c) airport at highest elevation

In [2]:
import xml.etree.ElementTree as ET
import pandas as pd
import numpy as np

In [4]:
md = ET.parse('C:/Users/Tim/Desktop/lighthouse/w2/d3/Other_data_types_exercise/mondial.xml')

In [5]:
md

In [6]:
root = md.getroot()
root

In [7]:
print(root.tag)
print(root.attrib)
print(len(root))

mondial
{}
3403

In [8]:
#10 countries with the lowest infant mortality rates

clim = pd.DataFrame(columns=['country','infmort'])
country = ""
infmort = ""

#method 1
# for i in md.iterfind('country'):
#     country=i.find('name').text
#     for i2 in i.iter('infmort'):
#         infmort = float(i2.text)
#     clim.loc[len(clim)]=[country,infmort]

#method 2
# for country in root:
#     name_value = country.attrib['name']
#     my_dict['name'].append(name_value)

#     rank_value = country[0].text
#     my_dict['rank'].append(rank_value)

#     year_value = country[1].text
#     my_dict['year'].append(year_value)

#     gdppc_value = country[2].text
#     my_dict['gdppc'].append(gdppc_value)

# df = pd.DataFrame(my_dict) 
# df

# q1dict = {
#     'country': [],
#     'infmort': [],
# }

# for country in root:
#     namevalue = country[0].text
#     q1dict['country'].append(namevalue)
    
#     infmortv = country[2].text
#     q1dict['infmort'].append(infmortv)

# q1df = pd.DataFrame(q1dict)
# q1df.head()


for i in root:
    country = i.find('name').text
    for inmo in i.iter('infant_mortality'):
        infmort = float(inmo.text)
    clim.loc[len(clim)]=[country,infmort]

In [9]:
clim.sort_values(by=['infmort']).head(10)

            country  infmort
38           Monaco     1.81
98            Japan     2.13
36           Norway     2.48
117         Bermuda     2.48
106       Singapore     2.53
37           Sweden     2.60
10   Czech Republic     2.63
8             Spain     2.70
78        Hong Kong     2.73
79            Macao     3.13

In [10]:
#10 cities with the largest population

q2 = pd.DataFrame(columns=['city','population'])
city = ''
population = ''

for j in root:
    for j2 in j.iter('city'):
        city = j2.find('name').text
        for j3 in j2.iterfind('population'):
            population = float(j3.text)
        q2.loc[len(q2)]=[city,population]

In [11]:
q2.sort_values(by=['population'],ascending=False).head(10)

           city  population
1340   Shanghai  22315474.0
1423    Karachi  14916456.0
3169      Lagos  13745000.0
772    Istanbul  13710512.0
1528     Mumbai  12442373.0
479      Moskva  11979529.0
1339    Beijing  11716620.0
3085   Kinshasa  11575000.0
2811  SÃ£o Paulo  11152344.0
1402     Lahore  11126285.0

In [12]:
q2[q2['city']=="Shanghai"]

          city  population
1340  Shanghai  22315474.0

In [72]:
#name and country of a) longest river, b) largest lake and c) airport at highest elevation

q3a = pd.DataFrame(columns=['river','q3country','length'])

river=''
q3country=''
length=''

for k in root:
    for k2 in k.iter('river'):
        river = k2.find('name').text
        for k3 in k2.iter('length'):
            length = float(k3.text)
            q3country = k2.attrib['country']
        #for k4 in k2.iter('estuary'):
            #q3country = str(k4.text)
        
        
        
#     river = k.find('name').text
#     for k2 in k.iter('length'):
#         length = float(k2.text)
#     for k3 in k.iter('estuary'):
#         q3country = str(k3.text)
    #q3country = k.find('estuary').text

            q3a.loc[len(q3a)]=[river,q3country,length]

In [73]:
q3a.head()

               river q3country  length
0            Thjorsa        IS   230.0
1  JÃ¶kulsa a FjÃ¶llum        IS   206.0
2             Thames        GB   346.0
3             Severn        GB   354.0
4              Trent        GB   298.0

In [76]:
q3a.sort_values(by=['length'],ascending=False).head(1)

       river q3country  length
214  Yangtze        CN  6380.0

In [74]:
q3b = pd.DataFrame(columns=['lake','q3bcountry','size'])

lake=''
q3bcountry=''
size=''

for l in root:
    for l2 in l.iter('lake'):
        lake = l2.find('name').text
        for l3 in l2.iter('area'):
            size = float(l3.text)
            q3bcountry = l2.attrib['country']
        #for l4 in l2.iter('estuary'):
            #q3bcountry = str(l4.text)

            q3b.loc[len(q3b)]=[lake,q3bcountry,size]

In [75]:
q3b.head()

         lake q3bcountry    size
0  InarijÃ¤rvi         SF  1040.0
1   OulujÃ¤rvi         SF   928.0
2      Saimaa         SF  4370.0
3    PÃ¤ijÃ¤nne         SF  1118.0
4  Mjoesa-See          N   368.0

In [77]:
q3b.sort_values(by=['size'],ascending=False).head(1)

           lake      q3bcountry      size
59  Caspian Sea  R AZ KAZ IR TM  386400.0

In [78]:
q3c = pd.DataFrame(columns=['airport','q3ccountry','elevation'])

airport=''
q3ccountry=''
elevation=''

for m in root:
    for m2 in m.iter('airport'):
        airport = m2.find('name').text
        for m3 in m2.iter('elevation'):
            elevation = float(m3.text)
            q3ccountry = m2.attrib['country']
        #for m4 in m2.iter('estuary'):
            #q3ccountry = str(m4.text)


            q3c.loc[len(q3c)]=[airport,q3ccountry,elevation]

In [79]:
q3c.head()

                airport q3ccountry  elevation
0                 Herat        AFG      977.0
1            Kabul Intl        AFG     1792.0
2          Tirana Rinas         AL       38.0
3  Cheikh Larbi Tebessi         DZ      811.0
4         Batna Airport         DZ      822.0

In [80]:
q3c.sort_values(by=['elevation'],ascending=False).head(1)

         airport q3ccountry  elevation
81  El Alto Intl        BOL     4063.0